# BuiltInFailures.WorksharingFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WorksharingFailures Class
BuiltInFailures Class Members See Also
---
Failures about WorksharingFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class WorksharingFailures
```

Visual Basic
---
```text
Public NotInheritable Class WorksharingFailures
```

Visual C++
---
```text
public ref class WorksharingFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..WorksharingFailures
# See Also
BuiltInFailures..::..WorksharingFailures Members
Autodesk.Revit.DB Namespace